const questions = [
  {
    category: "programming",
    questions: [
      {
        question: "ปริมาตรของลูกบาศก์ที่มีความยาวด้าน 4 เซนติเมตร คือ ",
        options: [" 8 ลบ.ซม.", " 12 ลบ.ซม.", " 16 ลบ.ซม.", " 64 ลบ.ซม"],
        correctAnswer: 3,
      },
      {
        question: "พื้นที่ผิวของทรงกลมที่มีรัศมี 7 ซม. คือเท่าใด (ใช้ 𝜋=22/7π=22/7)",
        options: [" 308 ตร.ซม", " 616 ตร.ซม.", " 1,232 ตร.ซม", " 343 ตร.ซม."],
        correctAnswer: 1,
      },
      {
        question: "พื้นที่สามเหลี่ยมที่มีฐาน 10 ซม. สูง 8 ซม. คือ",
        options: [" 18 ตร.ซม", " 20 ตร.ซม", " 40 ตร.ซม", "80 ตร.ซม."],
        correctAnswer: 2,
      },
      {
        question: "ทรงกระบอกมีรัศมี 3 ซม. สูง 10 ซม. ปริมาตรเท่ากับเท่าใด (ใช้ 𝜋=3.14π=3.14)",
        options: [" 282.6 ลบ.ซม", " 94.2 ลบ.ซม.", " 301.4 ลบ.ซม", " 314 ลบ.ซม."],
        correctAnswer: 0,
      },
      {
        question: "สี่เหลี่ยมผืนผ้ามีความยาว 12 ซม. กว้าง 5 ซม. เส้นทแยงมุมยาวเท่าใด",
        options: [" 12.5 ซม", " 13 ซม.", " 10 ซม. ", " 11 ซม."],
        correctAnswer: 1,
      },
      {
        question: "พื้นที่วงกลมที่มีรัศมี 14 ซม. เท่ากับ (ใช้ 𝜋=227π=722)",
        options: [" 308 ตร.ซม.", " 616 ตร.ซม.", "154 ตร.ซม.", " 44 ตร.ซม."],
        correctAnswer: 0,
      },
      {
        question: "ปริมาตรของปริซึมฐานสามเหลี่ยมที่มีพื้นที่ฐาน 30 ตร.ซม. และสูง 12 ซม. คือ",
        options: [" 180 ลบ.ซม.", " 240 ลบ.ซม", " 360 ลบ.ซม", " 400 ลบ.ซม"],
        correctAnswer: 2,
      },
      {
        question: "ปริมาตรของกรวยที่มีรัศมี 3 ซม. สูง 12 ซม. เท่ากับ (ใช้ 𝜋=3.14π=3.14)",
        options: [" 113.04 ลบ.ซม.", " 150 ลบ.ซม.", " 226.08 ลบ.ซม.", " 339.12 ลบ.ซม"],
        correctAnswer: 2,
      },
      {
        question: "ถ้าทรงกลมมีปริมาตร 43𝜋𝑟334	πr3แล้วเมื่อรัศมีเพิ่มเป็น 2 เท่า ปริมาตรจะเพิ่มกี่เท่า",
        options: [" 2 เท่า", " 4 เท่า", " 6 เท่า", " 8 เท่า"],
        correctAnswer: 3,
      },
      {
        question: "พีระมิดฐานสี่เหลี่ยมมีพื้นที่ฐาน 25 ตร.ซม. และสูง 9 ซม. ปริมาตรเท่ากับ",
        options: [" 50 ลบ.ซม.", " 60 ลบ.ซม", " 65 ลบ.ซม", " 75 ลบ.ซม"],
        correctAnswer: 3,
      },
    ],
  },
];